//#######    MatrixKEY driver for OAKS Multi I/O Board	#######
//#######             M16C/62P CPU					#######
//#######             version 1.0					#######
//#######           By OAKS support	(KH)	        #######

/*----------------------------------------------------------*/
/* 関数名	:InitKEY()										*/
/* 機能		:スイッチ入力初期化							    */
/*----------------------------------------------------------*/
void InitKEY( void );

/*----------------------------------------------------------*/
/* 関数名	:KEYInput()										*/
/* 機能		:キーマトリックス(4x4)入力（２キーロックアウト）*/
/* 戻り値	:上から1行目左端SWを最上位ビットに順に16bits配置*/
/*	**** 15,14,13,12	<- SWが押されると該当ビットに1が立つ*/
/*	**** 11,10, 9, 8										*/
/*	****  7, 6, 5, 4										*/
/*	****  3, 2, 1, 0										*/
/*----------------------------------------------------------*/
unsigned int KEYInput( void );

//////////////////////////end